package com.itschool.classes;

public class Utils {
   private static final String[] names = {
           "Веанор",
           "Вегафард",
           "Ведедим",
           "Веденей",
           "Ведений",
           "Везентий",
           "Вейко",
           "Вейкун",
           "Вектор",
           "Велентин",
           "Велерий",
           "Вели",
           "Велизар",
           "Велимамед",
           "Велимет",
           "Велимир",
           "Велимор",
           "Велимурад",
           "Велиор",
           "Велирий",
           "Велислав",
           "Велияддин",
           "Велиямин",
           "Велло",
           "Велорий"
   };
   private static final String[] departments = {
           "n/a",
           "Інститут бізнесу, економіки та інформаційних технологій",
           "Інститут електромеханіки та енергоменеджменту",
           "Інститут енергетики та комп’ютерно-інтегрованих систем управління",
           "Інститут інформаційної безпеки, радіоелектроніки та телекомунікацій",
           "Інститут комп’ютерних систем",
           "Інститут машинобудування та транспорту",
           "Інститут медичної інженерії",
           "Інститут промислових технологій, дизайну та менеджменту",
           "Інститут штучного інтелекту та робототехніки",
           "Гуманітарний факультет",
           "Хіміко-технологічний факультет",
           "Інститут дистанційної та заочної освіти",
           "Українсько-іспанський інститут",
           "Українсько-німецький інститут",
           "Українсько-польський інститут",
           "Інститут підготовки іноземних громадян" };

   public static String getRandomName() {
      return names[(int) (Math.random() * names.length)];
   }

   static public String getDepartmentByID(int id) {
      return (id > departments.length || id < 0) ? departments[0].strip() : departments[id].strip();
   }

   static public String getRandomDepartment() {
      return getDepartmentByID((int) (Math.random() * departments.length));
   }
}
